In [8]:
Tabla_lista_mercado= pd.DataFrame({"Enero":[3600,3100,6000,5600,10000],
                  "Febrero":[2000,3125,5599,5124,7000],
                  "Marzo":[2400,3900,7560,1200,5090],
                  "Abril":[2090,3500,6000,5600,10000]},index=['arroz','pasta','leche','pan','huevos'])
Tabla_lista_mercado

        Enero  Febrero  Marzo  Abril
arroz    3600     2000   2400   2090
pasta    3100     3125   3900   3500
leche    6000     5599   7560   6000
pan      5600     5124   1200   5600
huevos  10000     7000   5090  10000

In [3]:
import pandas as pd
lista_mercado =pd.Series({"arroz":3600,
                  "pasta":3100,
                  "leche":6000,
                  "pan":5600,
                  "huevos":10000,
                  "fresas":4800,
                  "helado":9800,
                  "naranjas":2600,
                  "garbanzos":3000,
                  "harina":2316})
print(lista_mercado)

arroz         3600
pasta         3100
leche         6000
pan           5600
huevos       10000
fresas        4800
helado        9800
naranjas      2600
garbanzos     3000
harina        2316
dtype: int64

# Febrero y Marzo

In [10]:
Tabla_lista_mercado [["Febrero","Marzo"]]

        Febrero  Marzo
arroz      2000   2400
pasta      3125   3900
leche      5599   7560
pan        5124   1200
huevos     7000   5090

#Abril

In [11]:
Tabla_lista_mercado [["Abril"]]

        Abril
arroz    2090
pasta    3500
leche    6000
pan      5600
huevos  10000